basic_python = ["코딩이란?", "파이썬이란?", "파이썬 입출력", "변수", "자료형", "연산자", "조건문", "반복문", "함수", "모듈"]

data_structure = ["함수의 재귀호출", "연결리스트", "스택", "큐", "트리", "이진 트리", "그래프", "해시"]

algorithm = ["탐색 알고리즘", "정렬 알고리즘", "그래프 탐색", "브루트포스", "Greedy", "Back Tracking", "분할정복", "동적계획법"]

data_analysis = ["빅데이터", "데이터 분석 방법론", "웹크롤링", "EDA", "결측치와 이상치", "Matplotlib", "Numpy", "Pandas", "확률 분석", "통계 분석"]

ai = ["인공지능이란?", "기계 학습", "지도 학습", "자율 학습", "강화 학습", "딥러닝", "GAN", "RNN", "CNN", "텐서플로우"]

integrated_version = [
    ["코딩이란?", "파이썬이란?", "파이썬 입출력", "변수", "자료형", "연산자", "조건문", "반복문", "함수", "모듈"],
    ["함수의 재귀호출", "연결리스트", "스택", "큐", "트리", "이진 트리", "그래프", "해시"],
    ["탐색 알고리즘", "정렬 알고리즘", "그래프 탐색", "브루트포스", "Greedy", "Back Tracking", "분할정복", "동적계획법"],
    ["빅데이터", "데이터 분석 방법론", "웹크롤링", "EDA", "결측치와 이상치", "Matplotlib", "Numpy", "Pandas", "확률 분석", "통계 분석"],
    ["인공지능이란?", "기계 학습", "지도 학습", "자율 학습", "강화 학습", "딥러닝", "GAN", "RNN", "CNN", "텐서플로우"]
]