basic_python_json = {
    "data": [
        "코딩이란? [1: 아직 모른다! | 4: 의미를 설명할 수 있다! | 7: 코딩을 통해 무엇을 할 수 있는지 말할 수 있다!]",
        "파이썬이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 파이썬 프로그램을 설치할 수 있다!]",
        "파이썬의 입출력이란? [1: 아직 모른다! | 4: input()/print()를 안다! | 7: 파싱과 포맷팅을 활용한 입출력을 할 수 있다!]",
        "파이썬의 변수란? [1: 아직 모른다! | 4: 변수를 선언할 수 있다! | 7: 변수를 사용할 수 있다!]",
        "파이썬의 자료형이란? [1: 아직 모른다! | 4: int, float 등을 안다! | 7: list, tuple 등을 안다!]",
        "파이썬의 연산자란? [1: 아직 모른다! | 4: 산술 연산자를 사용할 수 있다! | 7: 논리, 관계 연산자를 사용할 수 있다!]",
        "파이썬의 조건문이란? [1: 아직 모른다! | 4: if문을 사용할 수 있다! | 7: elif, else문을 사용할 수 있다!]",
        "파이썬의 반복문이란? [1: 아직 모른다! | 4: for, while문을 사용할 수 있다! | 7: 다중 반복문을 사용할 수 있다!]",
        "파이썬의 함수란? [1: 아직 모른다! | 4: def사용 및 함수 호출을 할 수 있다! | 7: 매개변수를 사용할 수 있다!]",
        "파이썬의 모듈이란? [1: 아직 모른다! | 4: import를 사용할 수 있다! | 7: 필요한 모듈을 불러오고 활용할 수 있다!]"
    ]
}

data_structure_json = {
    "data": [
        "함수의 재귀적 호출이란? [1: 아직 모른다! | 4: 개념을 설명할 수 있다! | 7: 함수의 재귀적 호출을 구현할 수 있다!]",
        "연결리스트란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 포인터를 활용하여 연결리스트를 구현할 수 있다!]",
        "스택이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 스택을 구현할 수 있다!]",
        "큐란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 큐를 구현할 수 있다!]",
        "트리란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 트리를 구현할 수 있다!]",
        "이진트리란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 이진트리를 구현할 수 있다!]",
        "그래프란? [1: 아직 모른다! | 4: 여러 종류의 그래프를 설명할 수 있다! | 7: 여러 종류의 그래프를 구현할 수 있다!]",
        "해시란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 해시를 구현할 수 있다!]"
    ]
}

algorithm_json = {
    "data": [
        "탐색 알고리즘이란? (순차, 이분, ..) [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 탐색 알고리즘을 구현할 수 있다!]"
        "정렬 알고리즘이란? (선택, 병합, 퀵, ..) [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 정렬 알고리즘을 구현할 수 있다!]"
        "그래프 탐색 알고리즘이란? (DFS, BFS, ..) [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 그래프 탐색 알고리즘을 구현할 수 있다!]"
        "브루트포스 알고리즘이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 브루트포스 알고리즘을 구현할 수 있다!]"
        "Greedy 알고리즘이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 Greedy 알고리즘을 구현할 수 있다!]"
        "Back Tracking 알고리즘이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 Back Tracking 알고리즘을 구현할 수 있다!]"
        "분할정복 알고리즘이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 분할정복 알고리즘를 구현할 수 있다!]"
        "동적계획법이란? [1: 아직 모른다! | 4: 무엇인지 설명할 수 있다! | 7: 주 언어로 동적계획법을 구현할 수 있다!]"
    ]
}

data_analysis_json = {
    "data": [
        "데이터 분석 개념에 대한 이해 정도",
        "데이터 수집 방법에 대한 이해 정도",
        "EDA 과정에 대한 이해 정도",
        "데이터 분석 방법론에 대한 이해 정도"
    ]
}

ai_json = {
    "data": [
        "인공지능이란? [1: 아직 모른다! | 4: 개념을 설명할 수 있다! | 7: 인공지능을 통해 무엇을 할 수 있는지 안다!]",
        "기계 학습이란? [1: 아직 모른다! | 4: 개념을 설명할 수 있다! | 7: 기계 학습의 적용 사례를 알고 있다!]",
        "지도 학습이란? [1: 아직 모른다! | 4: 분류와 회귀의 개념을 알고있다! | 7: 결정트리, SVM, KNN의 개념을 알고 있다!]",
        "자율 학습이란? [1: 아직 모른다! | 4: 군집화의 개념을 알고있다! | 7: K-mean의 개념을 알고 있다!]",
        "강화 학습이란? [1: 아직 모른다! | 4: 강화 학습의 개념을 알고있다! | 7: 마르코프 결정 과정의 개념을 알고 있다!]",
        "딥러닝이란? [1: 아직 모른다! | 4: 인공신경망의 개념을 알고있다! | 7: 딥러닝 모델과 활용 분야를 알고있다!]",
        "GAN이란? [1: 아직 모른다! | 4: GAN의 개념을 알고있다! | 7: GAN의 활용 분야와 방법을 알고있다!]",
        "RNN이란? [1: 아직 모른다! | 4: RNN의 개념을 알고있다! | 7: RNN의 활용 분야와 방법을 알고있다!]",
        "CNN이란? [1: 아직 모른다! | 4: CNN의 개념을 알고있다! | 7: CNN의 활용 분야와 방법을 알고있다!]",
        "텐서플로우란? [1: 아직 모른다! | 4: 텐서플로우의 기초 문법을 알고있다! | 7: 텐서플로우로 신경망 모델을 구현할 수 있다!]"
    ]
}