basic_python_json = {
    "data": [
        "코딩이란? [1: 아직 모른다! | 5: 의미를 설명할 수 있다! | 10: 코딩을 통해 무엇을 할 수 있는지 말할 수 있다!]"
        "파이썬이란? [1: 아직 모른다! | 5: 무엇인지 설명할 수 있다! | 10: 파이썬 프로그램을 설치할 수 있다!]"
        "파이썬의 입출력이란? [1: 아직 모른다! | 5: input()/print()를 안다! | 10: 파싱과 포맷팅을 활용한 입출력을 할 수 있다!]",
        "파이썬의 변수란? [1: 아직 모른다! | 5: 변수를 선언할 수 있다! | 10: 변수를 사용할 수 있다!]",
        "파이썬의 자료형이란? [1: 아직 모른다! | 5: int, float 등을 안다! | 10: list, tuple 등을 안다!]",
        "파이썬의 연산자란? [1: 아직 모른다! | 5: 산술 연산자를 사용할 수 있다! | 10 : 논리, 관계 연산자를 사용할 수 있다!]",
        "파이썬의 조건문이란? [1: 아직 모른다! | 5: if문을 사용할 수 있다! | elif, else문을 사용할 수 있다!]",
        "파이썬의 반복문이란? [1: 아직 모른다! | 5: for, while문을 사용할 수 있다! | 10: 다중 반복문을 사용할 수 있다!]",
        "파이썬의 함수란? [1: 아직 모른다! | def사용 및 함수 호출을 할 수 있다! | 10: 매개변수를 사용할 수 있다!]",
        "파이썬의 모듈이란? [1: 아직 모른다! | 5: import를 사용할 수 있다! | 10: 필요한 모듈을 불러오고 활용할 수 있다!]"
    ]
}

data_structure_json = {
    "data": [
        "자료구조에 대한 이해 정도 ( 선형 자료구조 / 비선형 자료구조 )"
    ]
}

algorithm_json = {
    "data": [
        "알고리즘에 대한 이해 정도 ( 문제 해결 전략 / 문제 해결 절차 )"
    ]
}

data_analysis_json = {
    "data": [
        "데이터 분석 개념에 대한 이해 정도",
        "데이터 수집 방법에 대한 이해 정도",
        "EDA 과정에 대한 이해 정도",
        "데이터 분석 방법론에 대한 이해 정도"
    ]
}

ai_json = {
    "data": [
        "AI 개념에 대한 이해 정도"
    ]
}