basic_python_json = {
    "data": [
        "코딩이란? [1: 아예 모른다! | 5: 의미를 설명할 수 있다! | 10: 코딩을 통해 무엇을 할 수 있는지 말할 수 있다!]"
        "파이썬의 입출력이란? [1: input()/print()를 안다! | 5: 파싱과 포맷팅을 활용한 입출력을 안다! | 10: 파일입출력을 안다!]",

        "프로그램의 Input과 Output 구현에 대한 이해 정도 ( input()과 print() 함수 이해 정도 )",
        "변수 사용에 대한 이해 정도",
        "python 자료형에 대한 이해 정도",
        "연산자에 대한 이해 정도 ( 산술 연산자, 논리 연산자, 관계 연산자 )",
        "조건문/선택문에 대한 이해 정도 ( if문 활용 )",
        "반복문에 대한 이해 정도 ( for문 / while문 활용 )",
        "함수에 대한 이해 정도 ( def 정의 및 함수 호출 )",
        "모듈에 대한 이해 정도 ( import 활용 )"
    ]
}

data_structure_json = {
    "data": [
        "자료구조에 대한 이해 정도 ( 선형 자료구조 / 비선형 자료구조 )"
    ]
}

algorithm_json = {
    "data": [
        "알고리즘에 대한 이해 정도 ( 문제 해결 전략 / 문제 해결 절차 )"
    ]
}

data_analysis_json = {
    "data": [
        "데이터 분석 개념에 대한 이해 정도",
        "데이터 수집 방법에 대한 이해 정도",
        "EDA 과정에 대한 이해 정도",
        "데이터 분석 방법론에 대한 이해 정도"
    ]
}

ai_json = {
    "data": [
        "AI 개념에 대한 이해 정도"
    ]
}